//IMS92321 JOB
//JOBLIB    DD DSN=SYS1.USERLIB,DISP=SHR
//STEP01    EXEC PGM=C91321W
//OUTDD     DD DSN=I92321.OUT01,VOL=SER=DEFVOL,
//          DCB=(LRECL=40,RECFM=FB),DISP=(MOD,KEEP)
//SYSOUT    DD SYSOUT=*
//STEP02    EXEC PGM=C91321R
//INDD     DD DSN=I92321.OUT01,VOL=SER=DEFVOL,DISP=OLD
//SYSOUT    DD SYSOUT=*
